In [1]:
import numpy as np
import pandas as pd
import sqlalchemy
import matplotlib as plt
import matplotlib.pyplot as plt

from comm.factor_utils import FactorUtil

In [2]:
#tick_df = FactorUtil.read_tick_from_sql('FG2409', '20240101', '00:00:00', 100)
#tick_df.head()

In [3]:
# bar_df = FactorUtil.read_bar_from_sql('FG2409_MIN_1', '20240101', '00:00:00', 100)
# bar_df.head()

In [4]:
# window function
# bar_df.count()

In [5]:
bar_df_1 = FactorUtil.get_bar_df('FG2405_MIN_1', '20240401', '00:00:00', 100)
bar_df_1.head()

,O,H,L,C,V,AP,AV,BP,BV
ts,,,,,,,,,
2024-04-01 09:00:00,1452.0,1464.0,1448.0,1460.0,21229,1457.910,21850,1458.616,26455
2024-04-01 09:01:00,1460.0,1465.0,1460.0,1463.0,11550,1462.959,26348,1461.613,23120
2024-04-01 09:02:00,1462.0,1464.0,1460.0,1462.0,9130,1463.209,34791,1461.668,25795
2024-04-01 09:03:00,1462.0,1463.0,1453.0,1456.0,7080,1458.884,25112,1458.390,31530
2024-04-01 09:04:00,1456.0,1458.0,1454.0,1454.0,5745,1456.901,36676,1455.582,30866

In [6]:
bar_df_2 = FactorUtil.get_window_bar_df('FG2405_MIN_1', '20240401', '00:00:00', 100, 5)
bar_df_2[['O_4', 'H_4', 'O_3', 'H_3', 'O_2', 'H_2', 'O_1', 'H_1', 'O', 'H']].head()

20240329 22:55:00

,O_4,H_4,O_3,H_3,O_2,H_2,O_1,H_1,O,H
ts,,,,,,,,,,
2024-04-01 09:00:00,1460.0,1462.0,1461.0,1461.0,1460.0,1461.0,1459.0,1460.0,1452.0,1464.0
2024-04-01 09:01:00,1461.0,1461.0,1460.0,1461.0,1459.0,1460.0,1452.0,1464.0,1460.0,1465.0
2024-04-01 09:02:00,1460.0,1461.0,1459.0,1460.0,1452.0,1464.0,1460.0,1465.0,1462.0,1464.0
2024-04-01 09:03:00,1459.0,1460.0,1452.0,1464.0,1460.0,1465.0,1462.0,1464.0,1462.0,1463.0
2024-04-01 09:04:00,1452.0,1464.0,1460.0,1465.0,1462.0,1464.0,1462.0,1463.0,1456.0,1458.0